**Name**: Chuqi(Angel) Jin
**GitHub Username**: ChuqiAngelJin
**USC ID**: 9740-1051-51

In [4]:
!pip install pandas numpy

Requirement already satisfied: pandas in c:\users\diana\apython\miniconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy in c:\users\diana\apython\miniconda3\lib\site-packages (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\diana\apython\miniconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\diana\apython\miniconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\diana\apython\miniconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\diana\apython\miniconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [6]:
import pandas as pd
import numpy as np

**2(a)(b)(c)** Read in the datafile

In [8]:
salaries_data = pd.read_csv('Salaries.csv', index_col='playerID', header=0, skiprows=[1])
print(salaries_data)

           yearID teamID lgID    salary
playerID
bedrost01    1985    ATL   NL    550000
benedbr01    1985    ATL   NL    545000
campri01     1985    ATL   NL    633333
ceronri01    1985    ATL   NL    625000
chambch01    1985    ATL   NL    800000
...           ...    ...  ...       ...
treinbl01    2015    WAS   NL    512800
ugglada01    2015    WAS   NL    507500
werthja01    2015    WAS   NL  21000000
zimmejo02    2015    WAS   NL  16500000
zimmery01    2015    WAS   NL  14000000

[25574 rows x 4 columns]

**4(d)** Select required players

In [9]:
salaries_data[(salaries_data['teamID'].isin(['ATL','HOU'])) & (salaries_data['salary']>1000000)].index

Index(['hornebo01', 'murphda05', 'suttebr01', 'ryanno01', 'hornebo01',
       'murphda05', 'suttebr01', 'ryanno01', 'griffke01', 'murphda05',
       ...
       'feldmsc01', 'gonzama01', 'gregelu01', 'lowrije01', 'neshepa01',
       'quallch01', 'rasmuco01', 'singljo02', 'sippto01', 'valbulu01'],
      dtype='object', name='playerID', length=595)

**4(e)** Use the describe() method

In [10]:
salaries_data[salaries_data['teamID']=='ATL']['salary'].describe()

count    8.850000e+02
mean     2.207749e+06
std      3.434320e+06
min      6.000000e+04
25%      3.000000e+05
50%      6.000000e+05
75%      2.400000e+06
max      1.606180e+07
Name: salary, dtype: float64

**4(f)** Create a Python dictionary object

In [23]:
my_dict = {'playerID':[],'yearID':[], 'teamID':[], 'lgID':[], 'salary':[]} 
                  
for row in salaries_data.iterrows():
    my_dict['playerID'].append(row[0])
    my_dict['teamID'].append(row[1].teamID)
    my_dict['yearID'].append(row[1].yearID)
    my_dict['lgID'].append(row[1].lgID)
    my_dict['salary'].append(row[1].salary)

#print(my_dict)
pd.DataFrame(salaries_data.to_dict())

           yearID teamID lgID  salary
bedrost01    1995    ATL   NL  750000
benedbr01    1989    ATL   NL  395000
campri01     1986    ATL   NL  600000
ceronri01    1992    MON   NL  230000
chambch01    1986    ATL   NL  769452
...           ...    ...  ...     ...
barreaa01    2015    WAS   NL  514200
dendema01    2015    WAS   NL  512972
robincl01    2015    WAS   NL  525000
taylomi02    2015    WAS   NL  508700
treinbl01    2015    WAS   NL  512800

[4963 rows x 4 columns]

**4(g)**: Create the dataframe and change the header

In [24]:
df = pd.DataFrame(data=my_dict)
#df
new_col = {'playerID': 'a', 'yearID': 'b', 'teamID': 'c', 'lgID':'d', 'salary':'e'}
df.rename(columns=new_col, inplace=True)
df

               a     b    c   d         e
0      bedrost01  1985  ATL  NL    550000
1      benedbr01  1985  ATL  NL    545000
2       campri01  1985  ATL  NL    633333
3      ceronri01  1985  ATL  NL    625000
4      chambch01  1985  ATL  NL    800000
...          ...   ...  ...  ..       ...
25569  treinbl01  2015  WAS  NL    512800
25570  ugglada01  2015  WAS  NL    507500
25571  werthja01  2015  WAS  NL  21000000
25572  zimmejo02  2015  WAS  NL  16500000
25573  zimmery01  2015  WAS  NL  14000000

[25574 rows x 5 columns]

**Question 5**

**5(a)** create 2-dimensional python list object and convert to Numpy array object

In [28]:
list_obj = [[4, 8, 7],[6, 5, 3],[2, 9, 1]]
array_obj = np.array(list_obj)
array_obj

array([[4, 8, 7],
       [6, 5, 3],
       [2, 9, 1]])

**5(b)** Play with it

In [31]:
print('ndim', array_obj.ndim) 
print('shape', array_obj.shape) 
print('size', array_obj.size) 
print('itemsize', array_obj.itemsize) 
print('data', array_obj.data)

ndim 2
shape (3, 3)
size 9
itemsize 8
data <memory at 0x0000022A54493D30>

**5(c)** Play with it

In [33]:
array_obj.flatten()

array([4, 8, 7, 6, 5, 3, 2, 9, 1])

In [36]:
#array_obj.reshape()